panStamp/panstamp/arduino-1.6/arduino-1.6_patch/lin/tools/msp430/msp430/include/msp430fw425.h
#define SIFIS1_0            (0x0000)    /* SIF SIFIFG3 set with each count of SIFCNT1 */
#define SIFIS1_1            (0x0100)    /* SIF SIFIFG3 set if (SIFCNT1 mod  4)=0 */
#define SIFIS1_2            (0x0200)    /* SIF SIFIFG3 set if (SIFCNT1 mod 64)=0 */
#define SIFIS1_3            (0x0300)    /* SIF SIFIFG3 set if SIFCNT1 rolls over */
#define SIFIS2_0            (0x0000)    /* SIF SIFIFG4 set with each count of SIFCNT2 */
#define SIFIS2_1            (0x0400)    /* SIF SIFIFG4 set if (SIFCNT2 mod  4)=0 */
#define SIFIS2_2            (0x0800)    /* SIF SIFIFG4 set if (SIFCNT2 mod 64)=0 */
#define SIFIS2_3            (0x0C00)    /* SIF SIFIFG4 set if SIFCNT2 rolls over */
#define SIFS1_0             (0x0000)    /* SIF S1 Source : SIF0OUT */
#define SIFS1_1             (0x1000)    /* SIF S1 Source : SIF1OUT */
#define SIFS1_2             (0x2000)    /* SIF S1 Source : SIF2OUT */
#define SIFS1_3             (0x3000)    /* SIF S1 Source : SIF3OUT */
#define SIFS2_0             (0x0000)    /* SIF S2 Source : SIF0OUT */
#define SIFS2_1             (0x4000)    /* SIF S2 Source : SIF1OUT */
#define SIFS2_2             (0x8000)    /* SIF S2 Source : SIF2OUT */
#define SIFS2_3             (0xC000)    /* SIF S2 Source : SIF3OUT */

/* SIFCTL4 */
#define SIFDIV10            (0x0001)    /* SIF Clock Divider 1.0 */
#define SIFDIV11            (0x0002)    /* SIF Clock Divider 1.1 */
#define SIFDIV20            (0x0004)    /* SIF Clock Divider 2.0 */
#define SIFDIV21            (0x0008)    /* SIF Clock Divider 2.1 */
#define SIFDIV3A0           (0x0010)    /* SIF Clock Divider 3.0 */
#define SIFDIV3A1           (0x0020)    /* SIF Clock Divider 3.1 */
#define SIFDIV3A2           (0x0040)    /* SIF Clock Divider 3.2 */
#define SIFDIV3B0           (0x0080)    /* SIF Clock Divider 3.3 */
#define SIFDIV3B1           (0x0100)    /* SIF Clock Divider 3.4 */
#define SIFDIV3B2           (0x0200)    /* SIF Clock Divider 3.5 */
#define SIFQ6EN             (0x0400)    /* SIF Feedback 6 Enable */
#define SIFQ7EN             (0x0800)    /* SIF Feedback 7 Enable */
#define SIFCNT1ENP          (0x1000)    /* SIF Enable SIFCNT1 up count */
#define SIFCNT1ENM          (0x2000)    /* SIF Enable SIFCNT1 down count */
#define SIFCNT2EN           (0x4000)    /* SIF Enable SIFCNT2 count */
#define SIFCNTRST           (0x8000)    /* SIF Enable Counter Reset on Read */

#define SIFDIV1_1           (0x0000)    /* SIF Clock Divider 1: /1 */
#define SIFDIV1_2           (0x0001)    /* SIF Clock Divider 1: /2 */
#define SIFDIV1_4           (0x0002)    /* SIF Clock Divider 1: /4 */
#define SIFDIV1_8           (0x0003)    /* SIF Clock Divider 1: /8 */
#define SIFDIV2_1           (0x0000)    /* SIF Clock Divider 2: /1 */
#define SIFDIV2_2           (0x0004)    /* SIF Clock Divider 2: /2 */
#define SIFDIV2_4           (0x0008)    /* SIF Clock Divider 2: /4 */
#define SIFDIV2_8           (0x000C)    /* SIF Clock Divider 2: /8 */

#define SIFDIV3_2           (0x0000)    /* SIF Clock Divider 3: /2 */
#define SIFDIV3_6           (0x0010)    /* SIF Clock Divider 3: /6 */
#define SIFDIV3_10          (0x0020)    /* SIF Clock Divider 3: /10 */
#define SIFDIV3_14          (0x0030)    /* SIF Clock Divider 3: /14 */
#define SIFDIV3_18          (0x0040)    /* SIF Clock Divider 3: /18 */
#define SIFDIV3_22          (0x0050)    /* SIF Clock Divider 3: /22 */
#define SIFDIV3_26          (0x0060)    /* SIF Clock Divider 3: /26 */
#define SIFDIV3_30          (0x0070)    /* SIF Clock Divider 3: /30 */
#define SIFDIV3_42          (0x00B0)    /* SIF Clock Divider 3: /42 */
#define SIFDIV3_50          (0x0120)    /* SIF Clock Divider 3: /50 */
#define SIFDIV3_54          (0x00C0)    /* SIF Clock Divider 3: /54 */
#define SIFDIV3_66          (0x00D0)    /* SIF Clock Divider 3: /66 */
#define SIFDIV3_70          (0x0130)    /* SIF Clock Divider 3: /70 */
#define SIFDIV3_78          (0x00E0)    /* SIF Clock Divider 3: /78 */
#define SIFDIV3_90          (0x00F0)    /* SIF Clock Divider 3: /90 */
#define SIFDIV3_98          (0x01B0)    /* SIF Clock Divider 3: /98 */
#define SIFDIV3_110         (0x0150)    /* SIF Clock Divider 3: /110 */
#define SIFDIV3_126         (0x01C0)    /* SIF Clock Divider 3: /126 */
#define SIFDIV3_130         (0x0160)    /* SIF Clock Divider 3: /130 */
#define SIFDIV3_150         (0x0170)    /* SIF Clock Divider 3: /150 */
#define SIFDIV3_154         (0x01D0)    /* SIF Clock Divider 3: /154 */
#define SIFDIV3_162         (0x0240)    /* SIF Clock Divider 3: /162 */
#define SIFDIV3_182         (0x01E0)    /* SIF Clock Divider 3: /182 */
#define SIFDIV3_198         (0x0250)    /* SIF Clock Divider 3: /198 */
#define SIFDIV3_210         (0x01F0)    /* SIF Clock Divider 3: /210 */
#define SIFDIV3_234         (0x0260)    /* SIF Clock Divider 3: /234 */
#define SIFDIV3_242         (0x02D0)    /* SIF Clock Divider 3: /242 */
#define SIFDIV3_270         (0x0270)    /* SIF Clock Divider 3: /270 */
#define SIFDIV3_286         (0x02E0)    /* SIF Clock Divider 3: /286 */
#define SIFDIV3_330         (0x02F0)    /* SIF Clock Divider 3: /330 */
#define SIFDIV3_338         (0x0360)    /* SIF Clock Divider 3: /338 */
#define SIFDIV3_390         (0x0370)    /* SIF Clock Divider 3: /390 */
#define SIFDIV3_450         (0x03F0)    /* SIF Clock Divider 3: /450 */

/* SIFCTL5 */
#define SIFCLKEN            (0x0001)    /* SIF 0:SMCLK for SIFCLK / 1:SIFCLKG for SIFCLK */
#define SIFCLKGON           (0x0002)    /* SIF Switch SIFCLKG on */
#define SIFFNOM             (0x0004)    /* SIF Select Nominal Frequ. 0:4MHz / 1:1MHz */
#define SIFCLKFQ0           (0x0008)    /* SIF Clock Generator frequency adjust 0 */
#define SIFCLKFQ1           (0x0010)    /* SIF Clock Generator frequency adjust 1 */
#define SIFCLKFQ2           (0x0020)    /* SIF Clock Generator frequency adjust 2 */
#define SIFCLKFQ3           (0x0040)    /* SIF Clock Generator frequency adjust 3 */
#define SIFTSMRP            (0x0080)    /* SIF Timing State Machine Repeat mode */
#define SIFCNT30            (0x0100)    /* SIF Counter 3.0 */
#define SIFCNT31            (0x0200)    /* SIF Counter 3.1 */
#define SIFCNT32            (0x0400)    /* SIF Counter 3.2 */
#define SIFCNT33            (0x0800)    /* SIF Counter 3.3 */
#define SIFCNT34            (0x1000)    /* SIF Counter 3.4 */
#define SIFCNT35            (0x2000)    /* SIF Counter 3.5 */
#define SIFCNT36            (0x4000)    /* SIF Counter 3.6 */
#define SIFCNT37            (0x8000)    /* SIF Counter 3.7 */

