panStamp/panstamp/arduino-1.6/arduino-1.6_patch/lin/tools/msp430/msp430/include/msp430fw425.h
/* SIFTSM */
#define SIFCH0              (0x0001)    /* SIF Select channel for tsm: 0 */
#define SIFCH1              (0x0002)    /* SIF Select channel for tsm: 1 */
#define SIFLCEN             (0x0004)    /* SIF LC enable */
#define SIFEX               (0x0008)    /* SIF  */
#define SIFCA               (0x0010)    /* SIF  */
#define SIFCLKON            (0x0020)    /* SIF  */
#define SIFRSON             (0x0040)    /* SIF  */
#define SIFTESTS1           (0x0080)    /* SIF  */
#define SIFDAC              (0x0100)    /* SIF  */
#define SIFSTOP             (0x0200)    /* SIF  */
#define SIFACLK             (0x0400)    /* SIF  */
#define SIFREPEAT0          (0x0800)    /* SIF  */
#define SIFREPEAT1          (0x1000)    /* SIF  */
#define SIFREPEAT2          (0x2000)    /* SIF  */
#define SIFREPEAT3          (0x4000)    /* SIF  */
#define SIFREPEAT4          (0x8000)    /* SIF  */

/************************************************************
* Interrupt Vectors (offset from 0xFFE0)
************************************************************/

#define BASICTIMER_VECTOR   (0x0000)  /* 0xFFE0 Basic Timer */
#define PORT2_VECTOR        (0x0002)  /* 0xFFE2 Port 2 */
#define PORT1_VECTOR        (0x0008)  /* 0xFFE8 Port 1 */
#define TIMER0_A1_VECTOR    (0x000A)  /* 0xFFEA Timer0_A CC1-2, TA0 */
#define TIMER0_A0_VECTOR    (0x000C)  /* 0xFFEC Timer0_A CC0 */
#define SCANIF_VECTOR       (0x0012)  /* 0xFFF2 Scan Inteface */
#define WDT_VECTOR          (0x0014) /* 0xFFF4 Watchdog Timer */
#define COMPARATORA_VECTOR  (0x0016) /* 0xFFF6 Comparator A */
#define TIMER1_A1_VECTOR    (0x0018) /* 0xFFF8 Timer1_A CC1-4, TA1 */
#define TIMER1_A0_VECTOR    (0x001A) /* 0xFFFA Timer1_A CC0 */
#define NMI_VECTOR          (0x001C) /* 0xFFFC Non-maskable */
#define RESET_VECTOR        (0x001E) /* 0xFFFE Reset [Highest Priority] */

/* Alternate Names */
#define TIMERA1_VECTOR      TIMER0_A1_VECTOR
#define TIMERA0_VECTOR      TIMER0_A0_VECTOR

/************************************************************
* End of Modules
************************************************************/
#ifdef __cplusplus
}
#endif /* extern "C" */

#endif /* #ifndef __msp430xW42x */

